/*
 배열 포인터를 자세히 알아보기 위한 예제2.
 last modified 2021-07-29
*/
#include <stdio.h>
int main(void) {
	int array[2][3] = { 10,20,30,40,50,60 };
	int(*p)[3] = array;

	// 배열 요소의 주소 출력.
	printf("------------------#1--------------------\n");
	printf("%x %x %x \n", &p[0][0], &p[0][1], &p[0][2]);
	printf("%x %x %x \n", &p[1][0], &p[1][1], &p[1][2]);

	// 각 행의 주소를 출력.
	printf("------------------#2--------------------\n");
	printf("%x %x \n", p, p + 1);
	printf("%x %x \n", p[0], p[1]);
	printf("%x %x \n", *(p + 0), *(p + 1));

	// #3, #4 = 값 출력.
	printf("------------------#3--------------------\n");
	printf("%d %d %d \n", *(p[0] + 0), *(p[0] + 1), *(p[0] + 2));
	printf("%d %d %d \n", *(p[1] + 0), *(p[1] + 1), *(p[1] + 2));

	printf("------------------#4--------------------\n");
	printf("%d %d %d \n", *(*(p + 0) + 0), *(*(p + 0) + 1), *(*(p + 0) + 2));
	printf("%d %d %d \n", *(*(p + 1) + 0), *(*(p + 1) + 1), *(*(p + 1) + 2));

	// p[0] == *(p + 0)
	// p[1] == *(p + 1)

	return 0;
}